import { PremiumEmoji, premiumEmoji } from "../constants/emojis.js";

export const newServiceMessage = [
  `${premiumEmoji(PremiumEmoji.NERD)} <b>انتخاب نوع سرویس</b>`,
  "",
  "لطفاً یکی از <b>سرویس‌های زیر</b> را انتخاب کنید:",
  "",
  `${premiumEmoji(PremiumEmoji.DEPOSIT_BALANCE)} <b>سرویس اوتباند</b>`,
  "در این روش، اوتباند روی <b>سرور اختصاصی</b> شما فعال می‌شود. علاوه بر هزینه خرید سرویس از پنلوت، هزینه <b>ترافیک مصرفی سرور</b>، <b>نگهداری زیرساخت</b>، <b>مدیریت سرور</b> و رسیدگی به مشکلات احتمالی نیز بر عهده شما خواهد بود. این گزینه بیشتر برای افرادی مناسب است که <b>تجربه مدیریت سرور</b> دارند و ترجیح می‌دهند زیرساخت اختصاصی خود را داشته باشند.",
  "",
  `${premiumEmoji(PremiumEmoji.SERVICE_CELEBRATE)} <b>سرویس پنل</b>`,
  "اگر به دنبال یک <b>راهکار حرفه‌ای و بدون دردسر</b> هستید، <b>پنل اختصاصی</b> بهترین انتخاب است. تمامی زیرساخت، ترافیک مصرفی، نگهداری، بروزرسانی‌ها و <b>پشتیبانی فنی</b> توسط <b>پنلوت</b> مدیریت می‌شود و شما فقط کافی است کاربران خود را ایجاد کرده و <b>لینک اتصال</b> را در اختیار مشتریان قرار دهید.",
  "",
  `${premiumEmoji(PremiumEmoji.OCTOPUS)} <b>نوع سرویس</b> موردنظر خود را انتخاب کنید:`,
].join("\n");
